Tekla Open API Reference for Tekla Structures 2025
DrawingObjectEnumerator.Current Property
 Gets the current drawing object.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObject Current { get; }
Public ReadOnly Property Current As DrawingObject
	Get
Property Value
Type: DrawingObject
See Also
Reference
DrawingObjectEnumerator Class
Tekla.Structures.Drawing Namespace